/*********************************************************************************************************************\
* BootProjectKL16
*
* File:   boot.c
* Author: Derrick
* Change: Helen Chen
*
* Services performed by FREESCALE in this matter are performed AS IS and without any warranty.
* CUSTOMER retains the final decision relative to the total design and functionality of the end product.
* FREESCALE neither guarantees nor will be held liable by CUSTOMER for the success of this project.
* 
* FREESCALE disclaims all warranties, express, implied or statutory including, but not limited to, implied warranty
* of merchantability or fitness for a particular purpose on any hardware, software ore advise supplied to the project
* by FREESCALE, and or any product resulting from FREESCALE services.
* In no event shall FREESCALE be liable for incidental or consequential damages arising out of this agreement.
* CUSTOMER agrees to hold FREESCALE harmless against any and all claims demands or actions by anyone on account of any
* damage,or injury, whether commercial, contractual, or tortuous, rising directly or indirectly as a result of the
* advise or assistance supplied CUSTOMER in connection with product, services or goods supplied under this Agreement.
*
\*********************************************************************************************************************/



#include "hardware.h"                       // include MCU declarations
#include "boot.h"                           // include bootloader hardware declarations
#include "UART.h"

__attribute__ ((section (".NonVolatileData"))) uint8_t RunApp;	//11/9/14 change
__attribute__ ((section (".NonVolatileData"))) typ_BootFlag BootFlag;	//11/9/14 change
//
//
/*********************************************************************************************************************\
* Private type definitions
\*********************************************************************************************************************/

/*********************************************************************************************************************
**  Bootloader operational states
*/
typedef enum
{
  StateStart = 0,
  StateHello,
  StateHelloDone,
  StateNewPrompt,
  StatePrompt,
  StateGetCommand,
  StatePrintString,
  StateEraseFlash,
  StateFlashErasing,
  StateVerifyErase,
  StateEraseStatus,
  StateWaitForSrecord,
  StateGetSrecord,
  StateProgramSrecord,
  StateProgramNext,
  StateProgramDone,
  StateBadHexCharacter,
  StateLast,
} typ_StateID;

typedef enum
{
  PhaseWaitForS = 0,
  PhaseWaitForType,
  PhaseGetCountMSB,
  PhaseGetCountLSB,
  PhaseGetAddressMSB,
  PhaseGetAddressLSB,
  PhaseGetDataMSB,
  PhaseGetDataLSB,
  PhaseGetChecksumMSB,
  PhaseGetChecksumLSB,
  PhaseLast
} typ_PhaseID;


/*********************************************************************************************************************
**  Special SIM register structure to improve bootloader code efficiency.
**
**  SIM - Peripheral register structure
*/
typedef struct _BOOT_SIM_MemMap {
  uint32_t SOPT2;                           /**< System Options Register 2, offset: 0x00 */
  uint8_t RESERVED_1[4];
  uint32_t SOPT4;                           /**< System Options Register 4, offset: 0x08 */
  uint32_t SOPT5;                           /**< System Options Register 5, offset: 0x0C */
  uint8_t RESERVED_2[4];
  uint32_t SOPT7;                           /**< System Options Register 7, offset: 0x14 */
  uint8_t RESERVED_3[8];
  uint32_t SDID;                            /**< System Device Identification Register, offset: 0x20 */
  uint8_t RESERVED_4[12];
  uint32_t SCGC4;                           /**< System Clock Gating Control Register 4, offset: 0x30 */
  uint32_t SCGC5;                           /**< System Clock Gating Control Register 5, offset: 0x34 */
  uint32_t SCGC6;                           /**< System Clock Gating Control Register 6, offset: 0x38 */
  uint32_t SCGC7;                           /**< System Clock Gating Control Register 7, offset: 0x3C */
  uint32_t CLKDIV1;                         /**< System Clock Divider Register 1, offset: 0x40 */
  uint8_t RESERVED_5[4];
  uint32_t FCFG1;                           /**< Flash Configuration Register 1, offset: 0x48 */
  uint32_t FCFG2;                           /**< Flash Configuration Register 2, offset: 0x4C */
  uint8_t RESERVED_6[4];
  uint32_t UIDMH;                           /**< Unique Identification Register Mid-High, offset: 0x54 */
  uint32_t UIDML;                           /**< Unique Identification Register Mid Low, offset: 0x58 */
  uint32_t UIDL;                            /**< Unique Identification Register Low, offset: 0x5C */
  uint8_t RESERVED_7[156];
  uint32_t COPC;                            /**< COP Control Register, offset: 0xFC */
  uint32_t SRVCOP;                          /**< Service COP Register, offset: 0x100 */
} volatile *BOOT_SIM_MemMapPtr;
/*
**  Peripheral SIM base pointer
*/
#define BOOT_SIM_BASE_PTR                   ((BOOT_SIM_MemMapPtr)0x40048004u)


/*********************************************************************************************************************
**  Local copy of the register descriptions for the Kinetis L Flash Memory Module (FTFA).
**  Slightly modified to provide 32-bit accesses for improved code efficiency.
*/
typedef struct E2emu_FTFA_MemMap {
  uint8_t FSTAT;                                // offset: 0x00 = Flash Status Register
  uint8_t FCNFG;                                // offset: 0x01 = Flash Configuration Register
  uint8_t FSEC;                                 // offset: 0x02 = Flash Security Register
  uint8_t FOPT;                                 // offset: 0x03 = Flash Option Register

  union
  {
    uint32_t FCCOB0_3;                          // offset: 0x04 = Flash Common Command Object Registers 0-3 (32-bit)
    struct
    {
      uint8_t FCCOB3;                           // offset: 0x04 = Flash Common Command Object Register 3
      uint8_t FCCOB2;                           // offset: 0x05 = Flash Common Command Object Register 2
      uint8_t FCCOB1;                           // offset: 0x06 = Flash Common Command Object Register 1
      uint8_t FCCOB0;                           // offset: 0x07 = Flash Common Command Object Register 0
    } BYTE;
  }FCC_dword0_3;

  union
  {
    uint32_t FCCOB4_7;                          // offset: 0x08 = Flash Common Command Object Registers 4-7 (32-bit)
    struct
    {
      uint8_t FCCOB7;                           // offset: 0x08 = Flash Common Command Object Register 7
      uint8_t FCCOB6;                           // offset: 0x09 = Flash Common Command Object Register 6
      uint8_t FCCOB5;                           // offset: 0x0A = Flash Common Command Object Register 5
      uint8_t FCCOB4;                           // offset: 0x0B = Flash Common Command Object Register 4
    } BYTE;
  }FCC_dword4_7;

  union
  {
    uint32_t FCCOB8_B;                          // offset: 0x0C = Flash Common Command Object Registers 8-B (32-bit)
    struct
    {
      uint8_t FCCOBB;                           // offset: 0x0C = Flash Common Command Object Register B
      uint8_t FCCOBA;                           // offset: 0x0D = Flash Common Command Object Register A
      uint8_t FCCOB9;                           // offset: 0x0E = Flash Common Command Object Register 9
      uint8_t FCCOB8;                           // offset: 0x0F = Flash Common Command Object Register 8
    } BYTE;
  }FCC_dword8_B;

  uint8_t FPROT3;                               /**< Program Flash Protection Registers, offset: 0x10 */
  uint8_t FPROT2;                               /**< Program Flash Protection Registers, offset: 0x11 */
  uint8_t FPROT1;                               /**< Program Flash Protection Registers, offset: 0x12 */
  uint8_t FPROT0;                               /**< Program Flash Protection Registers, offset: 0x13 */
} volatile *BOOT_FTFA_MemMapPtr;
/*
**  Peripheral FTFA base pointer
*/
#define BOOT_FTFA_BASE_PTR                  ((BOOT_FTFA_MemMapPtr)0x40020000u)

/*********************************************************************************************************************
**  Data type definition used to ease manipulation of a 32-bit pointer.
*/
typedef union
{
  void (*func)(void);                           // use as a pointer to a function
